class Russian:
    strings = {
        "admin_only": "Эта команда только для администраторов.",
        "invalid_command": "Неверный формат команды. Используйте /user [ID] или /premium [ID].",
        "user_not_found": "Пользователь с ID `{userID}` не найден.",
        "user_added": "Пользователь `{userID}` зарегистрирован.",
        "user_removed": "Пользователь `{userID}` снят с регистрации.",
        "premium_added": "Пользователь `{userID}` повышен до премиума. Истекает {expiry_date}.",
        "premium_removed": "Статус премиум для пользователя `{userID}` удален.",
        "premium_error": "Произошла ошибка во время операции с премиум.",
        "premium_reg_error": "Произошла ошибка при регистрации премиум-пользователя.",
        "premium_unreg_error": "Произошла ошибка при снятии с регистрации премиум-пользователя.",
        "not_enough_arguments": "Пожалуйста, укажите хотя бы один идентификатор пользователя."
    }
