class Arabic:
    strings = {
        "no_cert_selected": "مرحباً، {user_first_name}! الرجاء اختيار شهادة من قائمة /start وحاول مرة أخرى. 🚀",
        "sign_error_retry": "حدث خطأ أثناء التوقيع، تتم إعادة المحاولة... ({failed_sign_attempt}/{max_sign_attempt})",
        "signing_failed": "❌ فشل التوقيع للملف {file_name}.",
        "unexpected_error": "حدث خطأ غير متوقع. إذا استمرت هذه المشكلة، يرجى الاتصال بالدعم.",
        "ipa_ready": "✅ تم توقيع IPA الخاص بك وهو جاهز.",
        "forgot_choice": "يبدو أنك نسيت تحديد شهادة. يرجى الذهاب إلى قائمة /start لاختيار واحدة.",
        "file_lost": "فُقد الملف أثناء عملية التوقيع.",
        "value_error": "حدث خطأ في القيمة أثناء عملية التوقيع.",
        "permission_error": "حدث خطأ في الإذن أثناء عملية التوقيع.",
        "signing_error": "فشلت عملية التوقيع.",
        "unknown_error": "حدث خطأ غير متوقع أثناء عملية التوقيع.",
        "select_certificate_button": "📝️ تحديد الشهادة",
        "signing_in_progress": "📝 توقيع...",
        "modifying_in_progress": "🔧 تعديل...",
        "executing_command": "جارٍ التنفيذ: {command}",
        "modify_retry_error": "حدث خطأ أثناء التعديل، جارى إعادة المحاولة... ({failed_modify_attempt}/{max_modify_attempt})",
        "fnfe_err": "تعذر العثور على الملف أثناء عملية التوقيع.",
        "ve_err": "حدث خطأ في القيمة أثناء عملية التوقيع.",
        "pe_err": "حدث خطأ في الإذن أثناء عملية التوقيع.",
        "unknown_sign_err": "حدث خطأ غير معروف أثناء عملية التوقيع.",
        "revoked_certificate": "تم إلغاء شهادتك. الرجاء تحديد شهادة جديدة."
    }
