class Hindi:
    strings = {
        "no_cert_selected": "नमस्ते, {user_first_name}! कृपया /start मेनू से एक प्रमाणपत्र चुनें और पुनः प्रयास करें। 🚀",
        "sign_error_retry": "हस्ताक्षर करते समय एक त्रुटि हुई, पुनः प्रयास किया जा रहा है... ({failed_sign_attempt}/{max_sign_attempt})",
        "signing_failed": "❌ {file_name} के लिए हस्ताक्षर विफल रहा।",
        "unexpected_error": "एक अप्रत्याशित त्रुटि हुई। यदि यह समस्या बनी रहती है, तो कृपया सहायता से संपर्क करें।",
        "ipa_ready": "✅ आपका IPA हस्ताक्षरित और तैयार है।",
        "forgot_choice": "लगता है आप प्रमाणपत्र चुनना भूल गए हैं। कृपया एक चुनने के लिए /start मेनू पर जाएं।",
        "file_lost": "हस्ताक्षर प्रक्रिया के दौरान फ़ाइल खो गई थी।",
        "value_error": "हस्ताक्षर प्रक्रिया के दौरान एक मान त्रुटि हुई।",
        "permission_error": "हस्ताक्षर प्रक्रिया के दौरान एक अनुमति त्रुटि हुई।",
        "signing_error": "हस्ताक्षर ऑपरेशन विफल रहा।",
        "unknown_error": "हस्ताक्षर प्रक्रिया के दौरान एक अप्रत्याशित त्रुटि हुई।",
        "select_certificate_button": "📝️ प्रमाणपत्र चुनें",
        "signing_in_progress": "📝 हस्ताक्षर कर रहा है...",
        "modifying_in_progress": "🔧 संशोधित कर रहा है...",
        "executing_command": "निष्पादित हो रहा है: {command}",
        "modify_retry_error": "संशोधित करते समय एक त्रुटि हुई, पुनः प्रयास किया जा रहा है... ({failed_modify_attempt}/{max_modify_attempt})",
        "fnfe_err": "हस्ताक्षर प्रक्रिया के दौरान फ़ाइल नहीं मिली।",
        "ve_err": "हस्ताक्षर प्रक्रिया के दौरान एक मान त्रुटि हुई।",
        "pe_err": "हस्ताक्षर प्रक्रिया के दौरान एक अनुमति त्रुटि हुई।",
        "unknown_sign_err": "हस्ताक्षर प्रक्रिया के दौरान एक अज्ञात त्रुटि हुई।",
        "revoked_certificate": "आपका प्रमाणपत्र रद्द कर दिया गया है। कृपया एक नया प्रमाणपत्र चुनें।"
    }
