class Hindi:
    strings = {
        "no_cert_selected": "नमस्ते, {user_first_name}! कृपया /start मेनू से एक प्रमाणपत्र चुनें और पुनः प्रयास करें। 🚀",
        "sign_error_retry": "हस्ताक्षर करते समय एक त्रुटि हुई, पुनः प्रयास किया जा रहा है... ({failed_sign_attempt}/{max_sign_attempt})",
        "signing_failed": "❌ {file_name} के लिए हस्ताक्षर विफल रहा।",
        "ipa_ready": "✅ आपका IPA हस्ताक्षरित और तैयार है।",
        "select_certificate_button": "📝️ प्रमाणपत्र चुनें",
        "signing_in_progress": "📝 हस्ताक्षर कर रहा है...",
        "modifying_in_progress": "🔧 संशोधित कर रहा है...",
        "fnfe_err": "हस्ताक्षर प्रक्रिया के दौरान फ़ाइल नहीं मिली।",
        "ve_err": "हस्ताक्षर प्रक्रिया के दौरान एक मान त्रुटि हुई।",
        "pe_err": "हस्ताक्षर प्रक्रिया के दौरान एक अनुमति त्रुटि हुई।",
        "unknown_sign_err": "हस्ताक्षर प्रक्रिया के दौरान एक अज्ञात त्रुटि हुई।",
    }
