class Korean:
    strings = {
        "no_cert_selected": "안녕하세요, {user_first_name}님! /start 메뉴에서 인증서를 선택하고 다시 시도해 주세요. 🚀",
        "sign_error_retry": "서명 중 오류가 발생했습니다. 다시 시도 중... ({failed_sign_attempt}/{max_sign_attempt})",
        "signing_failed": "❌ {file_name} 서명 실패",
        "ipa_ready": "✅ IPA 서명이 완료되었으며 준비되었습니다.",
        "select_certificate_button": "📝️ 증명서 선택",
        "signing_in_progress": "📝 서명 중...",
        "modifying_in_progress": "🔧 수정 중...",
        "fnfe_err": "서명 과정에서 파일을 찾을 수 없습니다.",
        "ve_err": "서명 과정에서 값 오류가 발생했습니다.",
        "pe_err": "서명 과정에서 권한 오류가 발생했습니다.",
        "unknown_sign_err": "서명 과정 중 알 수 없는 오류가 발생했습니다。",
    }
