class Russian:
    strings = {
        "no_cert_selected": "Здравствуйте, {user_first_name}! Пожалуйста, выберите сертификат в меню /start и попробуйте снова. 🚀",
        "sign_error_retry": "Произошла ошибка при подписании, повторная попытка... ({failed_sign_attempt}/{max_sign_attempt})",
        "signing_failed": "❌ Не удалось подписать {file_name}.",
        "ipa_ready": "✅ Ваш IPA подписан и готов.",
        "select_certificate_button": "📝️ Выбрать сертификат",
        "signing_in_progress": "📝 Подписание...",
        "modifying_in_progress": "🔧 Изменение...",
        "fnfe_err": "Файл не найден в процессе подписания.",
        "ve_err": "В процессе подписания произошла ошибка значения.",
        "pe_err": "В процессе подписания произошла ошибка разрешений.",
        "unknown_sign_err": "В процессе подписания произошла неизвестная ошибка.",
        "revoked_certificate": "Ваш сертификат был отозван. Пожалуйста, выберите новый сертификат."
    }
