class Russian:
    strings = {
        "no_cert_selected": "Здравствуйте, {user_first_name}! Пожалуйста, выберите сертификат в меню /start и попробуйте снова. 🚀",
        "sign_error_retry": "Произошла ошибка при подписании, повторная попытка... ({failed_sign_attempt}/{max_sign_attempt})",
        "signing_failed": "❌ Не удалось подписать {file_name}.",
        "unexpected_error": "Произошла непредвиденная ошибка. Если проблема не исчезнет, обратитесь в службу поддержки.",
        "ipa_ready": "✅ Ваш IPA подписан и готов.",
        "forgot_choice": "Кажется, вы забыли выбрать сертификат. Пожалуйста, перейдите в меню /start, чтобы выбрать его.",
        "file_lost": "Файл был утерян в процессе подписания.",
        "value_error": "В процессе подписания произошла ошибка значения.",
        "permission_error": "В процессе подписания произошла ошибка разрешений.",
        "signing_error": "Операция подписания не удалась.",
        "unknown_error": "В процессе подписания произошла непредвиденная ошибка.",
        "select_certificate_button": "📝️ Выбрать сертификат",
        "signing_in_progress": "📝 Подписание...",
        "modifying_in_progress": "🔧 Изменение...",
        "executing_command": "Выполнение: {command}",
        "modify_retry_error": "Произошла ошибка при изменении, повторная попытка... ({failed_modify_attempt}/{max_modify_attempt})",
        "fnfe_err": "Файл не найден в процессе подписания.",
        "ve_err": "В процессе подписания произошла ошибка значения.",
        "pe_err": "В процессе подписания произошла ошибка разрешений.",
        "unknown_sign_err": "В процессе подписания произошла неизвестная ошибка."
    }