class Arabic:
    strings = {
        "restart_requested": "🔄 **طلب إعادة تشغيل** بواسطة {user_full_name} (@{username})\nمعرف العملية: `{process_id}`",
        "restart_canceled": "🔄 تم إلغاء إعادة التشغيل.",
        "restart_aborted": "❌ تم إجهاض إعادة التشغيل.",
        "restart_awaiting": "⏳ في انتظار انتهاء المهام النشطة...\nالوقت المنقضي: {time_elapsed}",
        "restart_in_progress": "♻️ جاري إعادة التشغيل الآن... ({time_elapsed})",
        "restart_declined": "⛔ غير مصرح لك بإعادة تشغيل البوت.",
        "shutdown_requested": "🛑 **طلب إيقاف تشغيل** بواسطة {user_full_name} (@{username})\nمعرف العملية: `{process_id}`",
        "shutdown_aborted": "🛑 تم إجهاض إيقاف التشغيل.",
        "shutdown_awaiting": "⏳ يمكن إلغاء إيقاف التشغيل خلال الـ 10 ثواني القادمة...\nالوقت المنقضي: {time_elapsed}",
        "shutdown_in_progress": "♻️ جاري إيقاف التشغيل الآن... ({time_elapsed})",
        "shutdown_declined": "⛔ غير مصرح لك بإيقاف تشغيل البوت.",
        "permission_declined": "⛔ تم رفض الإذن."
    }