class Hindi:
    strings = {
        "restart_requested": "🔄 **पुनरारंभ का अनुरोध** {user_full_name} (@{username}) द्वारा\nPID: `{process_id}`",
        "restart_canceled": "🔄 पुनरारंभ रद्द कर दिया गया है।",
        "restart_aborted": "❌ पुनरारंभ रद्द कर दिया गया।",
        "restart_awaiting": "⏳ सक्रिय कार्यों के समाप्त होने की प्रतीक्षा कर रहा है...\nबीता हुआ समय: {time_elapsed}",
        "restart_in_progress": "♻️ अब पुनरारंभ हो रहा है... ({time_elapsed})",
        "restart_declined": "⛔ आपको बॉट को पुनरारंभ करने की अनुमति नहीं है।",
        "shutdown_requested": "🛑 **शटडाउन का अनुरोध** {user_full_name} (@{username}) द्वारा\nPID: `{process_id}`",
        "shutdown_aborted": "🛑 शटडाउन रद्द कर दिया गया।",
        "shutdown_awaiting": "⏳ शटडाउन अगले 10 सेकंड के भीतर रद्द किया जा सकता है...\nबीता हुआ समय: {time_elapsed}",
        "shutdown_in_progress": "♻️ अब शटडाउन हो रहा है... ({time_elapsed})",
        "shutdown_declined": "⛔ आपको बॉट को बंद करने की अनुमति नहीं है।",
        "permission_declined": "⛔ अनुमति अस्वीकृत।"
    }
