class Hindi:
    strings = {
        "restart_requested": "🔄 **पुनरारंभ का अनुरोध** {user_full_name} (@{username}) द्वारा\nPID: `{process_id}`",
        "restart_in_progress": "♻️ अब पुनरारंभ हो रहा है...",
        "restart_declined": "⛔ आपको बॉट को पुनरारंभ करने की अनुमति नहीं है।",
        "shutdown_requested": "🛑 **शटडाउन का अनुरोध** {user_full_name} (@{username}) द्वारा\nPID: `{process_id}`",
        "shutdown_in_progress": "♻️ अब शटडाउन हो रहा है...",
        "shutdown_declined": "⛔ आपको बॉट को बंद करने की अनुमति नहीं है।",
        "permission_declined": "⛔ अनुमति अस्वीकृत।"
    }
