class Hindi:
    strings = {
        "update_error": "{options} को अपडेट नहीं किया जा सका। त्रुटि: {error}.",
        "app_name_usage": "उपयोग: /name [नया ऐप नाम]",
        "unset_app_name": "ऐप नाम संशोधन रीसेट कर दिया गया है।",
        "set_app_name": "ऐप नाम **{name}** में बदल दिया जाएगा।",
        "app_version_usage": "उपयोग: /version [नया संस्करण]",
        "invalid_app_version": "अमान्य संस्करण प्रारूप। कृपया केवल संख्याएँ और बिंदु उपयोग करें (उदाहरण: 1.2.3)।",
        "unset_app_version": "ऐप संस्करण संशोधन रीसेट कर दिया गया है।",
        "set_app_version": "ऐप संस्करण **{version}** में बदल दिया जाएगा।",
        "app_id_usage": "उपयोग: /id [नया बंडल आईडी]",
        "unset_app_id": "बंडल आईडी संशोधन रीसेट कर दिया गया है।",
        "set_app_id": "बंडल आईडी **{id}** में बदल दिया जाएगा।",
        "min_os_usage": "उपयोग: /minos [संस्करण]",
        "invalid_min_os": "अमान्य OS संस्करण प्रारूप। कृपया केवल संख्याएँ और बिंदु उपयोग करें (उदाहरण: 15.0)।",
        "unset_min_os": "न्यूनतम OS संस्करण संशोधन रीसेट कर दिया गया है।",
        "set_min_os": "न्यूनतम OS संस्करण **{os_version}** पर सेट किया जाएगा।",
        "tweak_added_expecting_ipa": "ट्वीक जोड़ा गया: {file_name}. अब इसे लागू करने के लिए IPA फ़ाइल भेजें।",
        "error_while_resetting": "विकल्पों को रीसेट करते समय एक त्रुटि हुई: {error}."
    }
