class Russian:
    strings = {
        "save_error": "Не удалось сохранить {options}. Ошибка: {error}.",
        "update_error": "Не удалось обновить {options}. Ошибка: {error}.",
        "app_name_usage": "Использование: /name [новое название приложения]",
        "unset_app_name": "Изменение названия приложения сброшено.",
        "set_app_name": "Название приложения будет изменено на **{name}**.",
        "app_version_usage": "Использование: /version [новая версия]",
        "invalid_app_version": "Неверный формат версии. Используйте только цифры и точки (например, 1.2.3).",
        "unset_app_version": "Изменение версии приложения сброшено.",
        "set_app_version": "Версия приложения будет изменена на **{version}**.",
        "app_id_usage": "Использование: /id [новый идентификатор пакета]",
        "unset_app_id": "Изменение идентификатора пакета сброшено.",
        "set_app_id": "Идентификатор пакета будет изменен на **{id}**.",
        "min_os_usage": "Использование: /minos [версия]",
        "invalid_min_os": "Неверный формат версии ОС. Используйте только цифры и точки (например, 15.0).",
        "unset_min_os": "Изменение минимальной версии ОС сброшено.",
        "set_min_os": "Минимальная версия ОС будет установлена на **{os_version}**.",
        "unset_profile_removal": "Встроенный профиль больше не будет удаляться.",
        "set_profile_removal": "Встроенный профиль будет удален.",
        "tweak_added_expecting_ipa": "Твик добавлен: {file_name}. Теперь отправьте IPA-файл, чтобы применить его.",
        "error_while_resetting": "Произошла ошибка при сбросе настроек: {error}."
    }