class Russian:
    strings = {
        "unregistered_user": "Вы не зарегистрированы. Пожалуйста, свяжитесь с администратором для получения доступа.",
        "unsupported_file_type": "Неподдерживаемый тип файла: {file_extension}",
        "cooldown_wait": "Пожалуйста, подождите {time_to_wait} секунд перед отправкой следующего файла.",
        "cooldown_update": "Пожалуйста, подождите еще {time_to_wait} секунд...",
        "download_starting": "⏳ Начинается загрузка...",
        "high_demand": "Бот в настоящее время занят. Ваш запрос поставлен в очередь.",
        "reply_or_send_ipa_prompt": "Пожалуйста, ответьте на сообщение с файлом IPA или прямой ссылкой для скачивания."
    }