class Arabic:
    strings = {
        "user_not_registered": "أنت غير مسجل لاستخدام هذا البوت.",
        "available_cmds": "**الأوامر المتاحة**",
        "user_cmds": "**أوامر المستخدم**",
        "cmd_prefixes": "بادئات الأوامر النشطة: {prefixes}",
        "admin_cmds": "**أوامر المسؤول**",
        "help_cmd": "يعرض رسالة المساعدة هذه.",
        "speedtest_cmd": "يقيس سرعة الاتصال.",
        "info_cmd": "يعرض معلومات حول البوت.",
        "sign_cmd": "يوقع ملف IPA الذي تم الرد عليه.",
        "clear_cmd": "يعيد تعيين جميع خيارات التعديل.",
        "minos_cmd": "يحدد الحد الأدنى لإصدار نظام التشغيل المطلوب.",
        "id_cmd": "يغير معرف حزمة التطبيق.",
        "version_cmd": "يغير إصدار التطبيق.",
        "name_cmd": "يغير اسم التطبيق.",
        "update_cmd": "يحدث البوت من المستودع.",
        "duyur_cmd": "يرسل إعلانًا لجميع المستخدمين.",
        "exec_cmd": "ينفذ أمر shell.",
        "restart_cmd": "يعيد تشغيل البوت.",
        "shutdown_cmd": "يغلق البوت.",
        "user_cmd": "يدير تسجيلات المستخدمين.",
        "unknown_exception": "حدث خطأ أثناء معالجة طلب المساعدة من @{username} ({userID}): {error}"
    }
