class Arabic:
    strings = {
        "cert_loading_error": "⚠️ تعذر تحميل معلومات الشهادة.",
        "certificate_prompt": "📃 الرجاء تحديد شهادة.\nالمحدد حاليا: {selected}",
        "certificate_selected": "📌 تم تحديد الشهادة: {selected}",
        "cert_saved": "📌 تم حفظ الشهادة: {cert_name}",
        "already_selected": "⚠️ هذه الشهادة محددة بالفعل.",
        "no_selection": "لا يوجد",
        "back_button": "🔙 رجوع",
        "saving_error": "حدث خطأ في قاعدة البيانات. الرجاء المحاولة مرة أخرى.",
        "callback_error": "⚠️ حدث خطأ غير متوقع."
    }
