class Russian:
    strings = {
        "no_certificate_found": "Сертификаты не найдены.",
        "cert_loading_error": "⚠️ Не удалось загрузить информацию о сертификате.",
        "certificate_prompt": "📃 Пожалуйста, выберите сертификат.\nТекущий выбор: {selected}",
        "certificate_selected": "📌 Сертификат выбран: {selected}",
        "cert_saved": "📌 Сертификат сохранен: {cert_name}",
        "already_selected": "⚠️ Этот сертификат уже выбран.",
        "no_selection": "Не выбрано",
        "back_button": "🔙 Назад",
        "save_error": "Произошла ошибка базы данных. Пожалуйста, попробуйте еще раз.",
        "generic_error": "⚠️ Произошла непредвиденная ошибка."
    }