class Arabic:
    strings = {
        "welcome_registered": "مرحباً، {name}!\nأهلاً بك مرة أخرى. يمكنك الآن إرسال ملف IPA لتوقيعه.",
        "welcome_unregistered": "مرحباً، {name}!\nلاستخدام هذا البوت، يجب أن تكون مستخدمًا مسجلاً. يرجى الاتصال بالمسؤول للوصول.",
        "select_certificate": "📝️ تحديد الشهادة",
        "select_compression": "📚 تحديد الضغط",
        "select_language": "🌐 تحديد اللغة",
        "approval_purchase": "اتصل للموافقة / الشراء",
        "settings_button": "⚙️ الإعدادات",
        "settings_text": "الرجاء اختيار إعداد للتكوين:",
        "back_button": "🔙 رجوع"
    }