class Hindi:
    strings = {
        "welcome_registered": "नमस्ते, {name}!\nवापस स्वागत है। अब आप हस्ताक्षर करने के लिए एक IPA फ़ाइल भेज सकते हैं।",
        "welcome_unregistered": "नमस्ते, {name}!\nइस बॉट का उपयोग करने के लिए, आपको एक पंजीकृत उपयोगकर्ता होना चाहिए। पहुँच के लिए कृपया व्यवस्थापक से संपर्क करें।",
        "select_certificate": "📝️ प्रमाणपत्र चुनें",
        "select_compression": "📚 संपीड़न चुनें",
        "select_language": "🌐 भाषा चुनें",
        "approval_purchase": "अनुमोदन / खरीद के लिए संपर्क करें",
        "settings_button": "⚙️ सेटिंग्स",
        "settings_text": "कृपया कॉन्फ़िगर करने के लिए एक सेटिंग चुनें:",
        "back_button": "🔙 वापस जाएं"
    }
