class Russian:
    strings = {
        "welcome_registered": "Здравствуйте, {name}!\nС возвращением. Теперь вы можете отправить IPA-файл для подписи.",
        "welcome_unregistered": "Здравствуйте, {name}!\nЧтобы использовать этого бота, вам необходимо быть зарегистрированным пользователем. Пожалуйста, свяжитесь с администратором для получения доступа.",
        "select_certificate": "📝️ Выбрать сертификат",
        "select_compression": "📚 Выбрать сжатие",
        "select_language": "🌐 Выбрать язык",
        "approval_purchase": "Связаться для одобрения / покупки",
        "settings_button": "⚙️ Настройки",
        "settings_text": "Пожалуйста, выберите параметр для настройки:",
        "back_button": "🔙 Назад",
    }