class Arabic:
    strings = {
        "select_language": "🌐 **اختر لغة**",
        "selected": "المحدد:",
        "already_selected": "⚠️ هذه اللغة محددة بالفعل.",
        "save_failed": "⚠️ تعذر حفظ إعداد اللغة.",
        "new_language_selected": "🌐 تم تغيير اللغة بنجاح.",
        "error_in_language_selection": "⚠️ حدث خطأ أثناء اختيار اللغة.",
        "database_error": "حدث خطأ في قاعدة البيانات. الرجاء المحاولة مرة أخرى.",
        "language_clear_success": "تم مسح تفضيل اللغة. سيستخدم البوت الآن لغة عميلك.",
        "language_clear_failed": "لم يتم تعيين تفضيل اللغة.",
        "back_button": "🔙 رجوع",
        "clear_button": "🧹 مسح التحديد"
    }