class Russian:
    strings = {
        "select_language": "🌐 **Выберите язык**",
        "selected": "Выбрано:",
        "already_selected": "⚠️ Этот язык уже выбран.",
        "save_failed": "⚠️ Не удалось сохранить настройку языка.",
        "new_language_selected": "🌐 Язык успешно изменен.",
        "error_in_language_selection": "⚠️ Произошла ошибка при выборе языка.",
        "database_error": "Произошла ошибка базы данных. Пожалуйста, попробуйте еще раз.",
        "language_clear_success": "Языковые предпочтения сброшены. Бот теперь будет использовать язык вашего клиента.",
        "language_clear_failed": "Языковые предпочтения не были установлены.",
        "back_button": "🔙 Назад",
        "clear_button": "🧹 Очистить выбор",
    }
